DS Date base Sql Class-13

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect('my_studentdatabse2.db')

In [3]:
cur=db.cursor()

In [4]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 19)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [5]:
results=cur.execute("select id from student")

for i in results:
    print(i)

(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
(7,)
(8,)
(9,)

In [6]:
results=cur.execute("select * from student where id=6")

results.fetchone()

(6, 'Brain', 22)

In Sql 3 category 1.Create, Alter & drop 2.select update/delete quaery 3.Commit comment

#Update<Table-name> set<columnname>=<value> where <column>=<value>
# update student set marks =80 where id =5

Update Record

In [7]:
# Update the record

Sql="update student set age=35 where id=4"
cur.execute(sql)
db.commit()

NameError: name 'sql' is not defined

In [8]:
# Update the record

sql="update student set age=35 where id=4"
cur.execute(sql)
db.commit()

In [9]:
results=cur.execute("select * from student where id=4")
for row in results:
    print(row)

(4, 'Jack', 35)

In [10]:
results=cur.execute("select * from student")

for i in results:
    print(i)

(1, 'Andrew', 20)
(2, 'Smith', 19)
(3, 'John', 22)
(4, 'Jack', 35)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

In [11]:
# multiple record update using 'IN'

sql="update student set age=32 where id in (1,2)"
cur.execute(sql)
db.commit()

In [12]:
# verify if its updated/ insted i i will sing row

results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'Andrew', 32)
(2, 'Smith', 32)
(3, 'John', 22)
(4, 'Jack', 35)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

Delete any unwanted records

In [13]:
sql="delete from student where id=9"
cur.execute(sql)

In [14]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'Andrew', 32)
(2, 'Smith', 32)
(3, 'John', 22)
(4, 'Jack', 35)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)

alter table commend i will using to change the structutre of the table
alter table<table-name>drop<column-name>
alter student drop column marks in this way alter commnd work

Drop table student

In [15]:
sql='drop table student'
results=cur.execute(sql)

In [16]:
results=cur.execute("select * from student")
results.fetchall()

OperationalError: no such table: student

In [17]:
# db.close() means entire student data table has been close

db.close()

Entire life cycle of data base-creation of data base -creation of table-insertion data inside the table-Sql inside the table-updating the data inside the table-deleting the table inside table & droping the entire data base